In [7]:
 import pandas as pd

In [8]:
x =pd.read_csv("Student.csv")

In [17]:
x

    Name  Class    no.  age gender   weight Married
0  abhay      11  7329   20       5     145       8
1  Sumit      12  3674   19    male     156     yes
2    Raj      11  7895   17    male     145     yes
3   Ajay      10  6785   16    male     134      no
4   Anuj       9  8965   20       7     176      23
5   rina       8  7896   19  female     179     yes
6   riya      12  6789   18       5     165      no
7   anju      11  9876   17  female     167      66

In [21]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     8 non-null      object
 1   Class    8 non-null      int64
 2   no.      8 non-null      int64
 3   age      8 non-null      int64
 4   gender   8 non-null      object
 5   weight   8 non-null      int64
 6   Married  8 non-null      object
dtypes: int64(4), object(3)
memory usage: 580.0+ bytes

In [12]:
x.isnull().sum()

Name       0
Class      0
no.        0
age        0
gender     0
weight     0
Married    0
dtype: int64

In [20]:
x["Married"].value_counts()

Married
yes    4
no     2
23     1
66     1
Name: count, dtype: int64

In [18]:
x["Married"].replace("8","yes" , inplace = True)

In [19]:
x

    Name  Class    no.  age gender   weight Married
0  abhay      11  7329   20       5     145     yes
1  Sumit      12  3674   19    male     156     yes
2    Raj      11  7895   17    male     145     yes
3   Ajay      10  6785   16    male     134      no
4   Anuj       9  8965   20       7     176      23
5   rina       8  7896   19  female     179     yes
6   riya      12  6789   18       5     165      no
7   anju      11  9876   17  female     167      66